# RoutingCondition Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingCondition Constructor
RoutingCondition Class See Also
---
Creates a new RoutingCondition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RoutingCondition(
	double diameter
)
```

Visual Basic
---
```text
Public Sub New ( _
	diameter As Double _
)
```

Visual C++
---
```text
public:
RoutingCondition(
	double diameter
)
```

# ### Parameters
diameter
    Type: System..::..Double The diameter of a routing segment.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for diameter must be greater than 0 and no more than 30000 feet. |

# See Also
RoutingCondition Class
Autodesk.Revit.DB Namespace